app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "tetovske@yandex.ru"], ["LIMIT", 1]]
UPDATE "users" SET "preference" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["preference", "business"], ["updated_at", "2019-12-27 10:58:33.739097"], ["id", 1]]
---
  def update_preferences
    User.find_by(:email => current_user.email).update(preference: params[:pref])